// проверять путь к 1cv8s.exe
Procedure run() Экспорт
	obj.lg("running: initialize.bsl ");

  УбедитьсяВНаличииРабочихКаталогов();
	ПеренестиЛоги();
  УдалитьСтарыеДампы();
EndProcedure // run()

Процедура ПеренестиЛоги()
  КаталогЛогов = obj._["log_dir"];
  кт1 = Новый Файл(КаталогЛогов+"/1");
  Если Не кт1.Существует() Тогда
    СоздатьКаталог(кт1.ПолноеИмя);
  КонецЕсли;
  кт2 = Новый Файл(КаталогЛогов+"/2");
  Если Не кт2.Существует() Тогда
    СоздатьКаталог(кт2.ПолноеИмя);
  КонецЕсли;
  кт3 = Новый Файл(КаталогЛогов+"/3");
   Если Не кт3.Существует() Тогда
    СоздатьКаталог(кт3.ПолноеИмя);
  КонецЕсли;
  УдалитьФайлы(кт3.ПолноеИмя, ПолучитьМаскуВсеФайлы());
  мсФл2 = НайтиФайлы(кт2.ПолноеИмя, ПолучитьМаскуВсеФайлы());
  Для каждого фл Из мсФл2 Цикл
    ПереместитьФайл(фл.ПолноеИмя, кт3.ПолноеИмя+"/"+фл.Имя);
  КонецЦикла;
  мсФл1 = НайтиФайлы(кт1.ПолноеИмя, ПолучитьМаскуВсеФайлы());
  Для каждого фл Из мсФл1 Цикл
    ПереместитьФайл(фл.ПолноеИмя, кт2.ПолноеИмя+"/"+фл.Имя);
  КонецЦикла;

	логи = НайтиФайлы(КаталогЛогов, "*.log");
	Для каждого лг Из логи Цикл
    ПереместитьФайл(лг.ПолноеИмя, кт1.ПолноеИмя+"/"+лг.Имя);
	КонецЦикла;
КонецПроцедуры

Процедура УбедитьсяВНаличииРабочихКаталогов()

  КаталогБэкапа = Новый Файл(obj._["bak_dir"]+"/1C");
  Если Не КаталогБэкапа.Существует() Тогда
    obj.lg("Не обнаружен каталог NAS для сохранения dt файлов "+КаталогБэкапа.ПолноеИмя);
  КонецЕсли;
  КаталогВыгрузки = Новый Файл(obj._["dt_dir"]);
  Если Не КаталогВыгрузки.Существует() Тогда
    obj.lg("Не обнаружен каталог dt файлов "+КаталогВыгрузки.ПолноеИмя+". Создан.", 3);
    СоздатьКаталог(КаталогВыгрузки.ПолноеИмя);
  КонецЕсли;
  КаталогПротоколов =  Новый Файл(obj._["log_dir"]);
  Если Не КаталогПротоколов.Существует() Тогда
    obj.lg("Не обнаружен каталог файлов протоколов "+КаталогПротоколов.ПолноеИмя+". Создан.", 3);
    СоздатьКаталог(КаталогПротоколов.ПолноеИмя);
  КонецЕсли;

КонецПроцедуры // УбедитьсяВНаличииРабочихКаталогов()

Процедура УдалитьСтарыеДампы()
   УдалитьФайлы(obj._["dt_dir"], ПолучитьМаскуВсеФайлы());
КонецПроцедуры // УдалитьСтарыеДампы()